import { Category } from '../types/types';

export const timelineData: Category[] = [
  {
    label: 'Наука',
    events: [
      {
        year: 2012,
        title: '2012',
        description:
          'Космический зонд Voyager 1 достиг границ гелиосферы, покидая Солнечную систему',
      },
      {
        year: 2014,
        title: '2014',
        description:
          'Зонд "Розетта" Европейского космического агентства успешно высадил модуль "Фила" на комету 67P',
      },
      {
        year: 2016,
        title: '2016',
        description:
          'Ученые из проекта LIGO впервые зафиксировали гравитационные волны',
      },
      {
        year: 2019,
        title: '2019',
        description:
          'Впервые опубликовано изображение чёрной дыры в галактике M87',
      },
      {
        year: 2025,
        title: '2025',
        description:
          'В 2025 году учёные разработали новый набор для синтетических цепей восприятия в клетках человека',
      },
    ],
  },
  {
    label: 'Литература',
    events: [
      {
        year: 2013,
        title: '2013',
        description:
          'Элеонора Каттон получила Букеровскую премию за роман "Светила"',
      },
      {
        year: 2015,
        title: '2015',
        description:
          'После 55-летнего перерыва опубликован роман Харпер Ли "Пойди поставь сторожа"',
      },
      {
        year: 2018,
        title: '2018',
        description:
          'Ольга Токарчук стала лауреатом Нобелевской премии по литературе',
      },
      {
        year: 2021,
        title: '2021',
        description:
          'Танзанийский писатель Абдулразак Гурна получил Нобелевскую премию по литературе',
      },
    ],
  },
  {
    label: 'Кино',
    events: [
      {
        year: 2010,
        title: '2010',
        description:
          'Фильм "Начало" режиссёра Кристофера Нолана стал мировым хитом, завоевав 4 премии "Оскар"',
      },
      {
        year: 2011,
        title: '2011',
        description:
          'Фильм "Артист" стал первым немым фильмом, получившим "Оскар" за лучший фильм с 1929 года',
      },
      {
        year: 2017,
        title: '2017',
        description:
          'Фильм "Форма воды" Гильермо дель Торо получил 4 "Оскара", включая лучший фильм и лучшую режиссуру',
      },
      {
        year: 2023,
        title: '2023',
        description:
          'Фильм "Оппенгеймер" Кристофера Нолана стал главной кинопремьерой года, выиграв премию "Оскар"',
      },
    ],
  },
  {
    label: 'История',
    events: [
      {
        year: 2008,
        title: '2008',
        description:
          'Барак Обама избран президентом США — первый афроамериканец на этом посту в истории страны',
      },
      {
        year: 2011,
        title: '2011',
        description:
          'Арабская весна привела к массовым протестам и сменам власти в странах Ближнего Востока',
      },
      {
        year: 2020,
        title: '2020',
        description:
          'Пандемия COVID-19 охватила мир, вызвав масштабный кризис в здравоохранении и глобальную изоляцию',
      },
      {
        year: 2022,
        title: '2022',
        description:
          '8 сентября 2022 года скончалась королева Елизавета II, правившая Великобританией более 70 лет',
      },
    ],
  },
  {
    label: 'Книги',
    events: [
      {
        year: 2009,
        title: '2009',
        description:
          'Опубликован роман "Игра Эндера" в России, вызвав интерес к жанру научной фантастики',
      },
      {
        year: 2017,
        title: '2017',
        description:
          'Опубликована автобиография "Becoming" Мишель Обамы, ставшая мировым бестселлером',
      },
      {
        year: 2020,
        title: '2020',
        description:
          'Вышла книга "Краткая история человечества" Юваля Ноя Харари на русском языке',
      },
      {
        year: 2024,
        title: '2024',
        description:
          'Издан роман "Prophet Song" Пола Линча — лауреата Букеровской премии 2023 года',
      },
    ],
  },
]; 